# Day 1 - Introduction to pandas, numpy, dataset and working of dataframes in pandas.

In [1]:
import pandas as pd
import numpy as np

In [6]:
arr = np.array([1, 2, 3, 4, 5, 6])
arr

array([1, 2, 3, 4, 5, 6])

In [7]:
type(arr)

numpy.ndarray

In [8]:
arr.dtype

dtype('int32')

In [9]:
newseries = pd.Series([3, 5, 3, 4, 5])
newseries

0    3
1    5
2    3
3    4
4    5
dtype: int64

In [10]:
type(newseries)

pandas.core.series.Series

In [11]:
newseries.dtype

dtype('int64')

In [12]:
newseries.size

5

In [13]:
newseries.shape

(5,)

In [14]:
roll = pd.Series([1,2,3,4,5])
name = pd.Series(['name1', 'name2', 'name3', 'name4', 'name5'])
marks = pd.Series([65.423, 32.5 ,52,23.5, 23.23, 52.34])

In [16]:
df = pd.DataFrame({
    'roll' : roll,
    'name' : name,
    'marks' : marks
    }
)
df

   roll   name   marks
0   1.0  name1  65.423
1   2.0  name2  32.500
2   3.0  name3  52.000
3   4.0  name4  23.500
4   5.0  name5  23.230
5   NaN    NaN  52.340

In [17]:
df.shape

(6, 3)

In [18]:
df.size

18

In [19]:
df.dtypes

roll     float64
name      object
marks    float64
dtype: object

In [25]:
df = pd.read_csv('C:/AdnanData/projects/codingResources/datasets/student.csv' )
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [27]:
df2 = pd.read_csv("C:\AdnanData\projects\codingResources\datasets\student3.tsv", sep = "\t")
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [29]:
df3 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')
df3

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [31]:
df4 = pd.read_excel("C:\AdnanData\projects\codingResources\datasets\student.xlsx")
df4

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
df.ndim

2

In [33]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [34]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [35]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [37]:
df.head(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [38]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21